import React from "react";
import Link from "next/link";

const CookiePolicyPage = () => {
  return (
    <div className="mt-20 flex flex-col items-center mb-40">
      <h1 className="font-bold text-xl">ПОЛИТИКА В ОТНОШЕНИИ ФАЙЛОВ COOKIE</h1>

      <div className="w-8/12 lg:w-6/12 text-lg font-sans mt-5">
        <p className="text-pretty self-start">
          Дата последнего обновления:
          <br /> «20» января 2025 года
        </p>
        <h2 className="mt-5 text-xl font-bold">1. Общие положения</h2>
        <p>
          1.1. Настоящая Политика в отношении файлов cookie (далее – «Политика»)
          объясняет, что такое файлы cookie, как и зачем они используются на
          веб-сайте{" "}
          <Link
            className="underline text-sky-600 cursor-pointer"
            href={"https://atlantys.kz"}
          >
            https://atlantys.kz
          </Link>{" "}
          и на платформе{" "}
          <Link
            className="underline text-sky-600 cursor-pointer"
            href={"https://platform.atlantys.kz"}
          >
            https://platform.atlantys.kz
          </Link>{" "}
          (далее совместно – «Сайт», «мы» или «наш Сайт»), а также какие у вас
          есть права и возможности по управлению настройками файлов cookie.{" "}
          <br />
          1.2. Настоящая Политика разработана с учётом требований Закона
          Республики Казахстан «О персональных данных и их защите» от 21 мая
          2013 года No 94-V (далее – «Закон»). Мы осуществляем сбор и обработку
          персональных данных пользователей (включая данные, получаемые
          посредством файлов cookie) строго в соответствии с положениями
          указанного Закона. <br />
          1.3. Используя Сайт, нажимая кнопку «Принять все cookie» либо
          продолжая работу c Сайтом после отображения информационного баннера о
          cookie, вы соглашаетесь с использованием файлов cookie и даёте своё
          согласие на обработку персональных данных в соответствии с условиями
          настоящей Политики и требованиями Закона, если иное не следует из
          настроек вашего браузера или вашего явного отказа (за исключением тех
          cookie, которые являются строго необходимыми). <br />
          1.4. В случае, если вы не согласны с какими-либо положениями настоящей
          Политики и не желаете, чтобы ваши персональные данные обрабатывались
          посредством файлов cookie, рекомендуем вам воздержаться от
          использования Сайта, либо отключить соответствующие категории cookie в
          настройках браузера (см. раздел 6).
        </p>

        <h2 className="mt-5 text-xl font-bold">2. Что такое файлы cookie</h2>
        <div>
          2.1. Файлы cookie – это небольшие текстовые файлы, которые сохраняются
          на вашем устройстве (компьютере, смартфоне, планшете и т.д.) при
          посещении веб-сайтов. Файлы cookie позволяют сайтам «запоминать» ваши
          действия и предпочтения (такие как язык, шрифты, настройки и другие
          параметры отображения) на протяжении некоторого времени, чтобы вам не
          нужно было заново указывать их при повторном посещении или переходе
          между страницами. <br />
          2.2. Файлы cookie могут быть «постоянными» или «сессионными»:
          <ul className="list-disc ml-12">
            <li>
              <span className="font-bold">Постоянные</span> файлы cookie
              хранятся браузером и действительны до установленного срока их
              истечения (если вы не удалите их раньше).{" "}
            </li>
            <li>
              <span className="font-bold">Сессионные</span> файлы cookie
              автоматически удаляются после окончания работы браузера или после
              выхода с сайта.
            </li>
          </ul>
          <br />
        </div>

        <h2 className="mt-5 text-xl font-bold">
          3. Цели использования файлов cookie
        </h2>
        <div>
          3.1. Мы используем файлы cookie для следующих целей: <br />
          <ul className="list-decimal ml-12">
            <li>
              <span className="font-bold">
                Обеспечение корректной работы Сайта:
              </span>{" "}
              некоторые файлы cookie необходимы для правильного функционирования
              нашего Сайта. Без них использование отдельных функций может
              оказаться невозможным. <br />
            </li>
            <li>
              <span className="font-bold">
                Улучшение удобства использования:
              </span>{" "}
              файлы cookie помогают «запоминать» ваши настройки и предпочтения
              (например, язык интерфейса), чтобы повысить удобство и скорость
              работы с Сайтом. <br />
            </li>
            <li>
              <span className="font-bold">Анализ и статистика:</span> мы можем
              использовать cookie для сбора статистических данных о посещениях,
              просмотрах страниц, времени, проведённом на Сайте, и других
              показателях, чтобы понять, как пользователи взаимодействуют с
              Сайтом, и улучшать его функциональность. <br />
            </li>
            <li>
              {" "}
              <span className="font-bold">Персонализация контента:</span> в
              некоторых случаях cookie могут использоваться для персонализации
              отображаемого контента и рекламы на основе ваших интересов и
              предыдущих взаимодействий с Сайтом.
            </li>
          </ul>
        </div>

        <h2 className="mt-5 text-xl font-bold">
          4. Виды используемых файлов cookie
        </h2>
        <div>
          На нашем Сайте могут использоваться следующие основные категории
          файлов cookie: <br />
          <ul className="list-decimal ml-12">
            <li>
              <span className="font-bold">Строго необходимые</span> (essential
              cookies) <br />
              <ul className="list-disc ml-10">
                <li>
                  {" "}
                  Эти файлы cookie необходимы для корректной работы Сайта и не
                  могут быть отключены в наших системах. Они обычно
                  устанавливаются только в ответ на ваши действия, такие как
                  настройка параметров конфиденциальности, вход в учётную запись
                </li>
                или заполнение форм. <br />
                <li>
                  Без этих cookie Сайт или некоторые его разделы могут работать
                  некорректно. <br />
                </li>
              </ul>
            </li>
            <li>
              <span className="font-bold">Аналитические/Статистические </span>
              (analytics cookies) <br />
              <ul className="list-disc ml-10">
                <li>
                  Эти файлы cookie помогают нам понимать, как посетители
                  взаимодействуют с Сайтом, предоставляя информацию о количестве
                  посетителей, источниках трафика и наиболее популярных
                  страницах. <br />
                </li>

                <li>
                  Мы используем эту информацию для улучшения работы Сайта и
                  удобства пользователей. <br />
                </li>
              </ul>
            </li>
            <li>
              <span className="font-bold">Функциональные </span>
              (functionality cookies) <br />
              <ul className="list-disc ml-10">
                <li>
                  {" "}
                  Эти файлы cookie позволяют Сайту запоминать сделанный вами
                  выбор (например, ваш логин, язык или регион, в котором вы
                  находитесь) и предоставлять улучшенные, более
                  персонализированные возможности. <br />
                </li>

                <li>
                  Если вы блокируете эти cookie, некоторые или все эти сервисы
                  могут работать некорректно. <br />
                </li>
              </ul>
            </li>
            <li>
              <span className="font-bold">Строго необходимые</span> (essential
              cookies) <br />
              <ul className="list-disc ml-10">
                <li>
                  {" "}
                  Эти файлы cookie необходимы для корректной работы Сайта и не
                  могут быть отключены в наших системах. Они обычно
                  устанавливаются только в ответ на ваши действия, такие как
                  настройка параметров конфиденциальности, вход в учётную запись
                </li>
                или заполнение форм. <br />
                <li>
                  Без этих cookie Сайт или некоторые его разделы могут работать
                  некорректно. <br />
                </li>
              </ul>
            </li>
            <li>
              <span className="font-bold">Рекламные/Маркетинговые</span>{" "}
              (advertising/marketing cookies) <br />
              <ul className="list-disc ml-10">
                <li>
                  Эти файлы cookie могут использоваться для показа рекламы,
                  более релевантной вашим интересам, а также для ограничения
                  количества показов одной и той же рекламы. <br />
                </li>

                <li>
                  Они могут быть установлены нами или сторонними рекламными
                  сетями (при наличии интеграции). <br />
                </li>

                <li>
                  Если эти cookie отключены, реклама будет менее релевантна
                  вашим интересам.
                </li>
              </ul>
            </li>
          </ul>
        </div>

        <h2 className="mt-5 text-xl font-bold">5. Сторонние файлы cookie</h2>
        <p>
          5.1. На нашем Сайте могут размещаться файлы cookie сторонних сервисов
          (например, сервисы аналитики, рекламные платформы, соцсети, плагины и
          т.д.). Такие сторонние провайдеры могут устанавливать собственные
          файлы cookie для отслеживания работы их сервисов или связывать их с
          функциональностью на нашем Сайте. <br />
          5.2. Мы не имеем доступа и контроля над этими файлами cookie.
          Информация, собранная с их помощью, регулируется политиками
          конфиденциальности соответствующих третьих сторон. Рекомендуем вам
          ознакомиться с политиками конфиденциальности и использования файлов
          cookie таких провайдеров.
        </p>

        <h2 className="mt-5 text-xl font-bold">6. Управление файлами cookie</h2>
        <div>
          6.1. У вас есть право в любой момент отказаться от использования
          файлов cookie или настроить их использование, за исключением строго
          необходимых cookie, которые обеспечивают базовые функции Сайта. <br />
          6.2. <span className="font-bold">Настройки браузера</span> <br />
          <ul className="list-disc ml-12">
            <li>
              Большинство веб-браузеров по умолчанию настроены на приём файлов
              cookie. Тем не менее вы можете изменить настройки браузера, чтобы
              блокировать файлы cookie или получать уведомления о том, когда они
              отправляются на ваше устройство. <br />
            </li>
            <li>
              {" "}
              Инструкции по управлению файлами cookie для популярных браузеров:{" "}
            </li>
          </ul>
          <ol className="ml-16">
            <li>o Chrome</li>
            <li>o Firefox</li>
            <li>o Safari</li>
            <li>o Edge</li>
            <li>o Opera</li>
          </ol>
          6.3.{" "}
          <span className="font-bold">
            Всплывающее уведомление (баннер) о cookie
          </span>
          <br />
          <ul className="list-disc ml-12">
            <li>
              При первом посещении нашего Сайта (и/или если вы не настроили
              ранее файлы cookie) вы можете увидеть всплывающее окно (баннер) с
              информацией о cookie и кнопками/ссылками для принятия или
              настройки файлов cookie.
            </li>
            <li>
              Вы можете выбрать, какие категории файлов cookie вы разрешаете
              (кроме строго необходимых), либо отказаться от всех, кроме
              необходимых.{" "}
            </li>
          </ul>
          <span className="ml-12">
            6.4. Обратите внимание, что отключение или удаление файлов cookie
            может привести к тому, что некоторые функции нашего Сайта станут
            недоступны или будут работать некорректно.
          </span>
        </div>

        <h2 className="mt-5 text-xl font-bold">
          7. Обновления и изменения в Политике
        </h2>
        <p>
          7.1. Мы можем время от времени вносить изменения в настоящую Политику,
          чтобы отразить изменения в используемых нами технологиях, в
          требованиях законодательства или по иным причинам. <br />
          7.2. Актуальная версия Политики всегда доступна на нашем Сайте. Просим
          вас периодически проверять актуальность настоящей Политики.
        </p>

        <h2 className="mt-5 text-xl font-bold">8. Контакты</h2>
        <p>
          8.1. Если у вас возникли вопросы касательно данной Политики или вы
          хотите реализовать свои права в отношении файлов cookie, свяжитесь с
          нами по следующему адресу электронной почты или по другим контактам,
          указанным на Сайте:
          <br />
          <span className="font-bold">Название компании:</span> ИП «Atlantys»{" "}
          <br />
          <span className="font-bold">E-mail:</span>
          main@atlantys.kz <br />
          <span className="font-bold">Телефон:</span> +7 700 022 19 48 <br />
          <span className="font-bold">Адрес:</span> Республика Казахстан, г.
          Алматы, ул. Сейфуллина, 609, БЦ Forum, оф. 6.
        </p>

        <h2 className="mt-5 text-xl font-bold">
          9. Меры защиты персональных данных
        </h2>
        <p>
          9.1. Мы принимаем необходимые организационные и технические меры,
          направленные на защиту персональных данных, которые собираются и
          обрабатываются посредством файлов cookie, от несанкционированного
          доступа, утраты, изменения или разглашения. <br />
          9.2. К таким мерам могут относиться использование протокола
          безопасного соединения (HTTPS), шифрование, ограничение прав доступа к
          данным, регулярное обновление программного обеспечения, а также иные
          методы, соответствующие требованиям Закона и другим применимым
          нормативным актам. <br />
          9.3. Мы гарантируем, что доступ к персональным данным пользователей,
          собираемым посредством файлов cookie, предоставляется только
          уполномоченным сотрудникам и (или) подрядчикам, которые связаны с нами
          соответствующими соглашениями о конфиденциальности и обязаны соблюдать
          безопасность персональных данных.
        </p>
      </div>
    </div>
  );
};

export default CookiePolicyPage;
