import React from "react";
import Link from "next/link";

const PolicyPage = () => {
  return (
    <div className="mt-20 flex flex-col items-center">
      <h1 className="font-bold text-xl">ПОЛИТИКА КОНФИДЕНЦИАЛЬНОСТИ</h1>
      <div className="w-8/12 lg:w-6/12 text-lg font-sans mt-5 mb-40">
        <p className="text-pretty">
          Настоящая Политика конфиденциальности (далее — «Политика») определяет
          порядок обработки и защиты персональных данных пользователей веб-сайта{" "}
          <Link
            className="underline text-sky-600 cursor-pointer"
            href="https://atlantys.kz"
          >
            https://atlantys.kz
          </Link>{" "}
          и платформы{" "}
          <Link
            className="underline text-sky-600 cursor-pointer"
            href="https://platform.atlantys.kz"
          >
            https://platform.atlantys.kz
          </Link>{" "}
          (далее — «Сайт» или «Платформа»).
        </p>

        <h2 className="mt-5 text-xl font-bold">1. ОБЩИЕ ПОЛОЖЕНИЯ</h2>
        <p>
          1.1. Настоящая Политика разработана в соответствии с Законом
          Республики Казахстан «О персональных данных и их защите» (No 94-V от
          21 мая 2013 года) и регулирует обработку персональных данных
          пользователей. <br />
          1.2. Оператором обработки персональных данных является Индивидуальный
          предприниматель «Atlantys», зарегистрированный по адресу: г. Алматы,
          ул. Манаса 22/2, 71. Контактная информация: main@atlantys.kz.
        </p>

        <h2 className="mt-5 text-xl font-bold">
          2. ОБОСНОВАНИЕ ОБРАБОТКИ ПЕРСОНАЛЬНЫХ ДАННЫХ
        </h2>
        <p>
          2.1. Мы обрабатываем персональные данные на основании следующих
          правовых оснований: - Вашего согласия на обработку данных. -
          Необходимости обработки данных для выполнения договора. - Соблюдения
          требований законодательства Республики Казахстан. - Законных интересов
          оператора, включая улучшение работы сайта и обеспечение безопасности.
          <br />
          2.2. Если данные передаются за пределы Республики Казахстан (например,
          в случае использования облачных сервисов или внешних аналитических
          платформ), мы обеспечиваем их защиту в соответствии с требованиями
          статьи 16 Закона Республики Казахстан «О персональных данных и их
          защите». В таких случаях мы гарантируем соблюдение всех установленных
          мер безопасности и, при необходимости, получение вашего явного
          согласия на передачу данных.
        </p>

        <h2 className="mt-5 text-xl font-bold">
          3. КАТЕГОРИИ ПОЛЬЗОВАТЕЛЕЙ И СОБИРАЕМЫХ ДАННЫХ
        </h2>
        <p>
          3.1. Мы собираем и обрабатываем данные в зависимости от категории
          пользователей: <br />
          1. Посетители сайта:
          <br /> - Технические данные: IP-адрес, тип и версия браузера,
          информация об операционной системе, данные о поведении на сайте,
          включая использование cookies. <br />- Цель: Анализ посещений сайта,
          улучшение его работы, обеспечение безопасности. <br />
          2. Зарегистрированные пользователи платформы:
          <br /> <br />- Контактная информация: имя, фамилия, номер телефона,
          адрес электронной почты. <br />- Данные учетной записи: логин и
          пароль. <br />- Техническая информация: IP-адрес, данные о
          подключении, время входа. <br />- Цель: Создание и управление учетной
          записью, предоставление доступа к функционалу платформы, обеспечение
          безопасности. <br />
          3. Контрагенты: <br />- Имя, фамилия, контактные данные (телефон,
          электронная почта). <br />- Данные, необходимые для заключения и
          исполнения договоров. <br />- Цель: Ведение деловой коммуникации,
          подписание договоров, обмен документами.
        </p>

        <h2 className="mt-5 text-xl font-bold">
          4. ЦЕЛИ ОБРАБОТКИ ПЕРСОНАЛЬНЫХ ДАННЫХ
        </h2>
        <p>
          4.1. Ваши персональные данные обрабатываются для следующих целей:
          <br /> - Обеспечение функционирования сайта и платформы. <br />-
          Оформление и выполнение заказов. <br />- Информирование о продуктах,
          услугах и акциях. <br />- Улучшение качества предоставляемых услуг и
          разработка новых функций. <br />- Анализ и статистическая обработка
          данных для повышения удобства пользователей. <br />- Обеспечение
          безопасности ваших данных и предотвращение несанкционированного
          доступа. <br />- Персонализация маркетинговых материалов и анализ
          эффективности рекламных кампаний. Если вы не хотите, чтобы ваши данные
          использовались для этих целей, вы можете отозвать своё согласие,
          написав нам на main@atlantys.kz.
        </p>

        <h2 className="mt-5 text-xl font-bold">
          5. ПЕРЕДАЧА ДАННЫХ ТРЕТЬИМ ЛИЦАМ
        </h2>
        <p>
          5.1. Мы передаём ваши персональные данные третьим лицам исключительно
          в следующих случаях: <br />- Для выполнения договора: курьерским
          службам, платёжным системам. <br />- Для выполнения требований
          законодательства: государственным органам Республики Казахстан в
          рамках их полномочий. <br />- Для технической поддержки: сервисным
          компаниям, обеспечивающим функционирование сайта и платформы. <br />
          5.2. Все партнёры обязаны соблюдать строгие меры конфиденциальности и
          безопасности данных. Мы гарантируем, что они обязаны следовать
          стандартам защиты данных, установленным законодательством Республики
          Казахстан, и что с ними заключены соответствующие соглашения о
          конфиденциальности. Мы также регулярно проводим аудит их систем и
          процессов, чтобы убедиться, что они соответствуют требованиям
          безопасности.
        </p>

        <h2 className="mt-5 text-xl font-bold">6. ПРАВА ПОЛЬЗОВАТЕЛЕЙ</h2>
        <p>
          6.1. В соответствии с Законом Республики Казахстан «О персональных
          данных и их защите», вы имеете право: <br />- Знать, как и какие ваши
          данные мы обрабатываем. <br />- Получить доступ к своим персональным
          данным. <br />- Требовать изменения, уточнения или удаления своих
          данных. <br />- Отозвать согласие на обработку данных в любое время.{" "}
          <br />- Ограничить обработку данных при наличии законных оснований.{" "}
          <br />- Получить свои данные в машиночитаемом формате (право на
          перенос данных). <br />
          6.2. Для реализации этих прав вы можете обратиться к нам по адресу
          main@atlantys.kz. <br />
          6.3. Для отзыва согласия на обработку персональных данных вы можете
          направить запрос по указанной электронной почте с темой «Отзыв
          согласия». Мы рассмотрим ваш запрос в течение 10 рабочих дней и
          проинформируем вас о результатах. Если необходимы дополнительные
          действия с вашей стороны, такие как подтверждение личности, мы заранее
          уведомим вас.
        </p>

        <h2 className="mt-5 text-xl font-bold">
          7. МЕРЫ ЗАЩИТЫ ПЕРСОНАЛЬНЫХ ДАННЫХ
        </h2>
        <p>
          7.1. Мы предпринимаем все необходимые технические и организационные
          меры для защиты ваших персональных данных от несанкционированного
          доступа, изменения, распространения или уничтожения. Эти меры
          включают: <br />- Использование протокола HTTPS для защищённого
          соединения.
          <br />- Ограничение доступа к данным только уполномоченным
          сотрудникам. <br />- Регулярное обновление программного обеспечения и
          антивирусной защиты.
          <br />- Применение шифрования для хранения и передачи конфиденциальных
          данных. <br />- Проведение регулярных внутренних аудитов безопасности
          данных, включая анализ текущих рисков и обновление подходов к защите.
          <br />
          7.2. Мы гарантируем, что партнёры, с которыми мы сотрудничаем, обязаны
          соблюдать те же стандарты защиты данных. Мы проверяем их соответствие
          требованиям путём регулярного аудита и заключения соглашений о защите
          данных.
        </p>

        <h2 className="mt-5 text-xl font-bold">
          8. ИЗМЕНЕНИЯ В ПОЛИТИКЕ КОНФИДЕНЦИАЛЬНОСТИ
        </h2>
        <p>
          8.1. Мы оставляем за собой право вносить изменения в настоящую
          Политику конфиденциальности. <br />8.2. Обновлённая версия Политики вступает
          в силу с момента её публикации на сайте. Мы рекомендуем вам
          периодически проверять данный раздел, чтобы быть в курсе актуальных
          изменений. <br />8.3. В случае значительных изменений мы можем уведомить вас
          посредством электронной почты или другого удобного способа.
        </p>
      </div>

    </div>
  );
};

export default PolicyPage;
